
"_connectToPortHelpTextFormat %@ %@" = "%@ on %@";
"_connectUsingProtocolHelpTextFormat %@ %@" = "%@ using the %@";
"_connectWithCountHelpTextFormat %@ %@ %@" = "On %@, %@ tried to establish more than %@ connections.";
"_helpTextFormat %@ %@ %@" = "On %@, %@ tried to establish a connection to %@.";
"_incomingHelpTextFormat %@ %@ %@" = "On %@, %@ tried to establish an incoming connection to %@.";
"_helpTextReplyInfoFormat %@ %@" = "The request was %@ %@.";
"_helpTextReplyInfoWithSuffixFormat %@ %@ %@" = "The request was %@ %@ %@.";

"_additionalNotes_launchdSSH" = "Starting with OS X Yosemite (10.10), incoming SSH connections are not accepted by /usr/sbin/sshd directly anymore. Instead, they are first accepted by launchd and then passed on to sshd.\nTherefore, an allow rule for incoming connections on port 22 to /sbin/launchd is required to accept SSH connections.";
"_additionalNotes_launchdSSHAutoMigrated" = "This rule was originally created for /usr/sbin/sshd but automatically converted because starting with OS X Yosemite (10.10), incoming SSH connections are not accepted by sshd directly anymore. Instead, they are first accepted by launchd and then passed on to sshd.\nTherefore, an allow rule for incoming connections on port 22 to /sbin/launchd is required to accept SSH connections.";
